run/isoAdvector/notchedDisc/baseCase/system/controlDict
	/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
	location		"system";
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     isoAdvector;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         1;

writeControl    adjustableRunTime;

writeInterval   .02;

deltaT          1e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression uncompressed;

timeFormat      general;

timePrecision   14;

graphFormat     raw;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           1e6;
maxAlphaCo      .75;

maxDeltaT       .5;

libs ( "libVOFInterpolationSchemes.so" );

// ************************************************************************* //
